[
  {
    "message": "The scientific name for axolotls is *Ambystoma                    mexicanum*!",
    "source": "https://www.nationalgeographic.com/animals/amphibians/facts/axolotl"
  },
  {
    "message": "Axolotls can survive in captivity for 10 to 15 years, and in the wild for five to six years.",
    "source": "https://www.nationalgeographic.com/animals/amphibians/facts/axolotl"
  },
  {
    "message": "The word \"axolotl\", alongside having mythological origins, translates from the Nahuatl language of the Aztecs as \"water dog.\"",
    "source": "https://animals.sandiegozoo.org/animals/axolotl"
  },
  {
    "message": "The common name for axolotls is said to originate from a legend about the Aztec god of fire and lightning, Xolotl. He apparently disguised himself as a salamander to avoid being sacrificed.",
    "source": "https://www.nationalgeographic.com/animals/amphibians/facts/axolotl"
  },
  {
    "message": "Axolotls are neotenic, keeping their larval characteristics (e.g. their aquatic nature, external gills, a tail, and a body fin) throughout adulthood.",
    "source": [
      "https://www.britannica.com/animal/axolotl",
      "https://animals.sandiegozoo.org/animals/axolotl"
    ]
  },
  {
    "message": "Axolotls eat fish, mollusks, aquatic insects, bloodworms, and other assorted small organisms. Occasionally, they will even eat other axolotls.",
    "source": [
      "https://www.britannica.com/animal/axolotl",
      "https://animals.sandiegozoo.org/animals/axolotl"
    ]
  },
  {
    "message": "Axolotls are only naturally found in Mexico City, specifically in Lake Xochimilco and Lake Chalco.",
    "source": "https://www.britannica.com/animal/axolotl"
  },
  {
    "message": "Axolotls can regenerate limbs and organs fully, although there are occasionally some deformaties.",
    "source": "https://animals.sandiegozoo.org/animals/axolotl"
  },
  {
    "message": "Axolotls have been classified as endangered since 2006. However, efforts are being made to conserve the wild population, mostly by selling them as pets and introducing captive populations into the wild.",
    "source": "https://animals.sandiegozoo.org/animals/axolotl"
  },
  {
    "message": "Axolotls are about 1,000 times more resistant to cancer than other species.",
    "source": "https://animals.sandiegozoo.org/animals/axolotl"
  },
  {
    "message": "Axolotls are a bit like chameleons, able to shift the hues a few shades to act as camouflage!",
    "source": "https://animals.sandiegozoo.org/animals/axolotl"
  },
  {
    "message": "Axolotls were introduced to Paris from Mexico in 1864, sparking a large European (and moreover, global) axolotl trade due to the ease of breeding in captivity.",
    "source": "https://www.nationalgeographic.com/animals/amphibians/facts/axolotl"
  },
  {
    "message": "It is estimated that only about 1,000 axolotls exist in the wild (as of July 2023).",
    "source": "https://www.britannica.com/animal/axolotl"
  },
  {
    "message": "Axolotls mate by doing a \"waltz\".",
    "source": "https://www.nationalgeographic.com/animals/amphibians/facts/axolotl"
  }
]
